<template>
  <div class="login">
    <!-- dialogFormVisible控制登录组件是否显示 -->
    <el-button text @click="Users.dialogFormVisible = true">
      登录/注册
    </el-button>
    <el-dialog v-model="Users.dialogFormVisible" title="登录/注册">
      <div class="contain">
        <!-- 这是左侧 -->
        <div class="loginfrom" v-if="sence=='0'">
          <el-form>
            <el-form-item label="">
              <el-input :prefix-icon="User" placeholder="请输入手机号码"></el-input>
              <el-input :prefix-icon="Lock" placeholder="请输入手机验证码"></el-input>
              <el-button>获取验证码</el-button>
            </el-form-item>
          </el-form>
          <div class="loginbottom">
            <el-button type="">用户登录</el-button>
            <p @click="handelechange('1')">微信扫码登录</p>
            <svg t="1696843975001" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
              p-id="5094" width="32" height="32">
              <path
                d="M639.598608 400.285662c8.233522 0 16.330944 0.61296 24.460088 1.500167-21.919219-100.839663-130.992403-175.736467-255.559467-175.736467-139.241274 0-253.29182 93.714382-253.29182 212.809827 0 68.709895 37.926798 125.137045 101.350293 168.969343l-25.311479 75.254961 88.549755-43.832298c31.670304 6.145977 57.06774 12.502755 88.703251 12.502755 7.960299 0 15.835663-0.349971 23.607674-0.928139-4.9088-16.746406-7.824199-34.243919-7.824199-52.491515C424.335916 489.005286 519.328407 400.285662 639.598608 400.285662L639.598608 400.285662zM503.458975 332.453764c19.142989 0 31.703049 12.416797 31.703049 31.235398 0 18.74083-12.56006 31.286564-31.703049 31.286564-18.937305 0-37.97694-12.544711-37.97694-31.286564C465.482035 344.82042 484.488925 332.453764 503.458975 332.453764L503.458975 332.453764zM326.205968 394.975726c-19.022239 0-38.163181-12.544711-38.163181-31.286564 0-18.818601 19.140942-31.235398 38.163181-31.235398 19.005866 0 31.619138 12.366655 31.619138 31.235398C357.825107 382.431016 345.211834 394.975726 326.205968 394.975726L326.205968 394.975726zM870.836133 595.333964c0-100.0466-101.352339-181.581592-215.179804-181.581592-120.543424 0-215.400838 81.57797-215.400838 181.581592 0 100.30345 94.907557 181.566242 215.400838 181.566242 25.226544 0 50.67617-6.239098 75.989695-12.510942l69.457932 37.652552-19.057031-62.572104C832.910359 701.730179 870.836133 651.752928 870.836133 595.333964L870.836133 595.333964zM585.787028 563.996235c-12.562107 0-25.311479-12.365632-25.311479-25.012673 0-12.4608 12.749372-25.00551 25.311479-25.00551 19.244296 0 31.721469 12.544711 31.721469 25.00551C617.508497 551.630602 605.031325 563.996235 585.787028 563.996235L585.787028 563.996235zM725.116307 563.996235c-12.477172 0-25.176402-12.365632-25.176402-25.012673 0-12.4608 12.647041-25.00551 25.176402-25.00551 19.057031 0 31.704073 12.544711 31.704073 25.00551C756.82038 551.630602 744.173338 563.996235 725.116307 563.996235L725.116307 563.996235zM725.116307 563.996235"
                p-id="5095"></path>
            </svg>
          </div>
        </div>
        <div class="wechatlogin" v-else>
          <img src="../../assets/images/code_login_wechat.png" alt="">
          <p @click="handelechange('0')">密码账号登录</p>
        </div>
        <!-- 二维码右侧 -->
        <div class="code">
          <div class="codetop">
            <div>
              <img src="../../assets/images/code_login_wechat.png" alt="">
              <svg t="1696844859022" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                p-id="5382" width="16" height="16">
                <path
                  d="M615.904 388.48c8.8 0 17.536 0.64 26.176 1.6-23.52-109.536-140.608-190.912-274.272-190.912C218.4 199.2 96 301.056 96 430.4c0 74.656 40.736 135.936 108.768 183.488l-27.2 81.792 95.04-47.648c33.984 6.72 61.28 13.632 95.2 13.632 8.544 0 16.992-0.416 25.376-1.088a202.496 202.496 0 0 1-8.384-56.96c0-118.752 101.984-215.136 231.104-215.136zM469.76 314.784c20.48 0 34.016 13.472 34.016 33.92 0 20.352-13.536 34.016-34.016 34.016-20.384 0-40.832-13.664-40.832-34.016 0-20.448 20.448-33.92 40.832-33.92zM279.52 382.72c-20.384 0-40.928-13.664-40.928-34.016 0-20.448 20.544-33.92 40.928-33.92 20.352 0 33.92 13.472 33.92 33.92 0 20.384-13.568 34.016-33.92 34.016z"
                  fill="" p-id="5383"></path>
                <path
                  d="M864 600.352c0-108.672-108.736-197.28-230.88-197.28-129.344 0-231.2 88.576-231.2 197.28 0 108.864 101.856 197.248 231.2 197.248 27.072 0 54.368-6.816 81.568-13.632l74.56 40.8-20.448-67.904C823.328 715.936 864 661.664 864 600.352z m-305.856-34.016c-13.536 0-27.2-13.44-27.2-27.2 0-13.568 13.664-27.2 27.2-27.2 20.576 0 34.016 13.632 34.016 27.2 0 13.76-13.44 27.2-34.016 27.2z m149.536 0c-13.44 0-27.008-13.44-27.008-27.2 0-13.568 13.568-27.2 27.008-27.2 20.352 0 34.016 13.632 34.016 27.2 0 13.76-13.664 27.2-34.016 27.2z"
                  fill="" p-id="5384"></path>
              </svg>
              <p>微信扫一扫关注</p>
              <p>"快速预约挂号"</p>
            </div>
            <div>
              <img src="../../assets/images/code_app.png" alt="">
              <svg t="1696844902722" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                p-id="7056" width="16" height="16">
                <path
                  d="M406.109091 251.578182v488.727273a23.272727 23.272727 0 0 0 23.272727 23.272727h302.545455a372.363636 372.363636 0 0 0-325.818182-512z m116.363636 465.454545v-46.545454h186.181818v46.545454z"
                  fill="#EDF6FF" p-id="7057"></path>
                <path
                  d="M359.563636 739.374545V252.043636a372.363636 372.363636 0 1 0 349.090909 557.149091h-279.272727a69.818182 69.818182 0 0 1-69.818182-69.818182z"
                  fill="#EDF6FF" p-id="7058"></path>
                <path
                  d="M801.745455 64.465455h-372.363637a69.818182 69.818182 0 0 0-69.818182 69.818181v605.090909a69.818182 69.818182 0 0 0 69.818182 69.818182h372.363637a69.818182 69.818182 0 0 0 69.818181-69.818182v-605.090909a69.818182 69.818182 0 0 0-69.818181-69.818181z m23.272727 674.90909a23.272727 23.272727 0 0 1-23.272727 23.272728h-372.363637a23.272727 23.272727 0 0 1-23.272727-23.272728v-605.090909a23.272727 23.272727 0 0 1 23.272727-23.272727h69.818182a43.752727 43.752727 0 0 0 43.52 42.589091h145.454545a43.752727 43.752727 0 0 0 43.52-42.589091h69.818182a23.272727 23.272727 0 0 1 23.272728 23.272727z"
                  fill="#040405" p-id="7059"></path>
                <path d="M522.472727 669.556364h186.181818v46.545454h-186.181818z" fill="#2394FB" p-id="7060"></path>
              </svg>
              <p>扫一扫下载</p>
              <p>"预约挂号App"</p>
            </div>
          </div>
          <div class="codebuttom">
            <p>冬预约官方指定平台</p>
            <p><x>快速挂号&nbsp;安全放心</x></p>
          </div>
        </div>
      </div>
      <template #footer>
        <span class="dialog-footer">
          <el-button type="primary" @click="Users.dialogFormVisible = false">
            关闭窗口
          </el-button>
        </span>
      </template>
    </el-dialog>
  </div>
</template>

<script setup lang="ts">
//引入小图标
import { User, Lock } from '@element-plus/icons-vue'

import { ref } from 'vue';

//控制微信是否扫码登录
let sence = ref<string>('0');

import useUser from '@/store/modules/user'
let Users = useUser()

//微信扫码登录显示方法
const handelechange = (text:string)=>{
  sence.value = text
}
</script>

<style scoped lang="scss">
.login {
  :deep(.el-dialog__header) {
    width: 100%;
    border-bottom: 2px solid rgba(211, 211, 211, 0.479);
  }
  :deep(.el-dialog__footer){
    border-top: 2px solid rgba(211, 211, 211, 0.479);
  }
}

.el-dialog {
  --el-dialog-width: 60%;
}

.contain {
  display: flex;
  height: 400px;

  .loginfrom {
    padding: 20px;
    flex: 5;
    height: 330px;
    width: 100%;
    border: 1px solid lightgray;
    border-radius: 5px;

    .el-form {
      display: flex;
      justify-content: center;

      .el-input {
        margin-bottom: 20px;
      }
    }

    .loginbottom {
      margin-top: 15px;
      display: flex;
      flex-direction: column;
      justify-content: center;
      text-align: center;
      align-items: center;

      .el-button {
        width: 100%;
        background-color: #9cceff;
        color: white;
        font-weight: 900;
        letter-spacing: 0.2em;
      }

      p {
        margin: 15px;
        &:hover{
          color: #9cceff;
        }
      }
    }
  }
  .wechatlogin{
    flex: 5;
    text-align: center;
    p{
      margin-top: 10px;
      &:hover{
        color: #9cceff;
      }
    }
  }

  .code {
    flex: 5;

    .codetop{
      display: flex;
      div{
        flex: 5;
        display: flex;
        justify-content: center;
        align-items: center;
        flex-direction: column;
        *{
          margin-bottom: 10px;
        }
        img{
          width: 150px;
        }
      }
    }
    .codebuttom{
      text-align: center;
      margin-top: 50px;
      font-size: 25px;
      p{
        margin-top: 20px;
        margin-bottom: 20px;
      }
    }
  }
}</style>